---
kind: property
id: P:Autodesk.Revit.DB.BasicFileInfo.IsCentral
source: html/0f412eca-700a-7e9e-570e-117f94c87d29.htm
---
# Autodesk.Revit.DB.BasicFileInfo.IsCentral Property

Checks if the file is workshared and Central.

## Syntax (C#)
```csharp
public bool IsCentral { get; }
```